Revit 2027 API
AnalysisDisplayVectorSettings.ArrowheadScale Property
 Type of arrow head scaling.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayStyleVectorArrowheadScale ArrowheadScale { get; set; }
Public Property ArrowheadScale As AnalysisDisplayStyleVectorArrowheadScale
	Get
	Set
public:
property AnalysisDisplayStyleVectorArrowheadScale ArrowheadScale {
	AnalysisDisplayStyleVectorArrowheadScale get ();
	void set (AnalysisDisplayStyleVectorArrowheadScale value);
}
member ArrowheadScale : AnalysisDisplayStyleVectorArrowheadScale with get, set
Property Value
AnalysisDisplayStyleVectorArrowheadScale
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace